HW05/endurance_result/endurance_html_report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 43327,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4630369053938503,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 6.0,
    "throughput" : 48.29802603123927,
    "receivedKBytesPerSec" : 18.673975879342997,
    "sentKBytesPerSec" : 6.080642920025728
  },
  "GET Order Detail" : {
    "transaction" : "GET Order Detail",
    "sampleCount" : 43327,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4630369053938503,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 83.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 6.0,
    "throughput" : 48.29802603123927,
    "receivedKBytesPerSec" : 18.673975879342997,
    "sentKBytesPerSec" : 6.080642920025728
  }
}